## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                         |
|--------|-----------------------------------------------------|
| add    | `aws_cloudwatch_log_group.saas_procurement_group`   |
|        | `aws_cloudwatch_log_stream.saas_procurement_stream` |
|        | `aws_ecs_cluster.saas_procurement`                  |
|        | `aws_ecs_service.main`                              |
|        | `aws_ecs_task_definition.saas_procurement`          |
|        | `aws_security_group.ecs_tasks`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.saas_procurement will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "saas_procurement" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "saas-procurement"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "aws_region"            = "ca-central-1"
          + "awslogs-group"         = "/ecs/saas-procurement-app"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-saas_procurement"
          + "fargate_cpu"           = "256"
          + "fargate_memory"        = "512"
          + "image"                 = ":latest"
        }
    }

  # aws_cloudwatch_log_group.saas_procurement_group will be created
  + resource "aws_cloudwatch_log_group" "saas_procurement_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/saas-procurement-app"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "saas-procurement-log-group"
        }
      + tags_all          = {
          + "Name" = "saas-procurement-log-group"
        }
    }

  # aws_cloudwatch_log_stream.saas_procurement_stream will be created
  + resource "aws_cloudwatch_log_stream" "saas_procurement_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/saas-procurement-app"
      + name           = "saas-procurement-log-stream"
    }

  # aws_ecs_cluster.saas_procurement will be created
  + resource "aws_ecs_cluster" "saas_procurement" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "saas-procurement-cluster"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "saas_procurement-service"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                           = {
          + "CostCentre" = "saas-procurement"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name = "saas_procurement"
          + container_port = 8000
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-061d1ba72b3063d92",
              + "subnet-08b6b67d74b37e07b",
              + "subnet-0d3a016c7742a6dab",
            ]
        }
    }

  # aws_ecs_task_definition.saas_procurement will be created
  + resource "aws_ecs_task_definition" "saas_procurement" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + family                   = "saas-procurement-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbout traffic for Saas procurement app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "saas-procurement-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all               = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                 = "vpc-04ac29c4ad6b4676e"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.saas_procurement_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
